I can confirm that Terraform **init** / **plan** are successful.

```
% terraform init
Initializing modules...
Downloading registry.terraform.io/terraform-google-modules/project-factory/google 13.1.0 for project_radlab_ds_analytics...
- project_radlab_ds_analytics in .terraform/modules/project_radlab_ds_analytics
- project_radlab_ds_analytics.budget in .terraform/modules/project_radlab_ds_analytics/modules/budget
- project_radlab_ds_analytics.essential_contacts in .terraform/modules/project_radlab_ds_analytics/modules/essential_contacts
- project_radlab_ds_analytics.gsuite_group in .terraform/modules/project_radlab_ds_analytics/modules/gsuite_group
- project_radlab_ds_analytics.project-factory in .terraform/modules/project_radlab_ds_analytics/modules/core_project_factory
- project_radlab_ds_analytics.project-factory.project_services in .terraform/modules/project_radlab_ds_analytics/modules/project_services
- project_radlab_ds_analytics.quotas in .terraform/modules/project_radlab_ds_analytics/modules/quota_manager
- project_radlab_ds_analytics.shared_vpc_access in .terraform/modules/project_radlab_ds_analytics/modules/shared_vpc_access
Downloading registry.terraform.io/terraform-google-modules/network/google 5.2.0 for vpc_ai_notebook...
- vpc_ai_notebook in .terraform/modules/vpc_ai_notebook
- vpc_ai_notebook.firewall_rules in .terraform/modules/vpc_ai_notebook/modules/firewall-rules
- vpc_ai_notebook.routes in .terraform/modules/vpc_ai_notebook/modules/routes
- vpc_ai_notebook.subnets in .terraform/modules/vpc_ai_notebook/modules/subnets
- vpc_ai_notebook.vpc in .terraform/modules/vpc_ai_notebook/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/null versions matching ">= 2.1.0"...
- Finding hashicorp/google-beta versions matching ">= 3.43.0, >= 3.45.0, >= 3.50.0, >= 3.87.0, ~> 4.11, < 5.0.0"...
- Finding hashicorp/google versions matching ">= 2.12.0, >= 3.43.0, >= 3.45.0, >= 3.50.0, >= 3.83.0, >= 3.87.0, ~> 4.5, ~> 4.11, < 5.0.0"...
- Finding hashicorp/random versions matching ">= 2.2.0"...
- Finding latest version of hashicorp/time...
- Installing hashicorp/null v3.1.1...
- Installed hashicorp/null v3.1.1 (signed by HashiCorp)
- Installing hashicorp/google-beta v4.32.0...
- Installed hashicorp/google-beta v4.32.0 (signed by HashiCorp)
- Installing hashicorp/google v4.32.0...
- Installed hashicorp/google v4.32.0 (signed by HashiCorp)
- Installing hashicorp/random v3.3.2...
- Installed hashicorp/random v3.3.2 (signed by HashiCorp)
- Installing hashicorp/time v0.8.0...
- Installed hashicorp/time v0.8.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
% 
```

```
% terraform plan
var.billing_account_id
  Billing Account associated to the GCP Resources

  Enter a value: abc


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_notebooks_instance.ai_notebook_usermanaged[0] will be created
  + resource "google_notebooks_instance" "ai_notebook_usermanaged" {
      + boot_disk_size_gb   = 100
      + boot_disk_type      = "PD_SSD"
      + create_time         = (known after apply)
      + id                  = (known after apply)
      + install_gpu_driver  = false
      + labels              = {
          + "module" = "data-science"
        }
      + location            = "us-central1-c"
      + machine_type        = "n1-standard-1"
      + metadata            = {
          + "proxy-mode" = "mail"
          + "terraform"  = "true"
        }
      + name                = "usermanaged-notebooks-1"
      + network             = (known after apply)
      + no_proxy_access     = false
      + no_public_ip        = false
      + post_startup_script = (known after apply)
      + project             = (known after apply)
      + proxy_uri           = (known after apply)
      + service_account     = (known after apply)
      + state               = (known after apply)
      + subnet              = (known after apply)
      + update_time         = (known after apply)

      + shielded_instance_config {
          + enable_integrity_monitoring = (known after apply)
          + enable_secure_boot          = (known after apply)
          + enable_vtpm                 = (known after apply)
        }

      + vm_image {
          + image_family = "tf-latest-cpu"
          + project      = "deeplearning-platform-release"
        }
    }

  # google_project_iam_member.sa_p_notebook_permissions["roles/bigquery.user"] will be created
  + resource "google_project_iam_member" "sa_p_notebook_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.sa_p_notebook_permissions["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "sa_p_notebook_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.sa_p_notebook_permissions["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "sa_p_notebook_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.sa_p_notebook_permissions["roles/notebooks.admin"] will be created
  + resource "google_project_iam_member" "sa_p_notebook_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/notebooks.admin"
    }

  # google_project_iam_member.sa_p_notebook_permissions["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "sa_p_notebook_permissions" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/storage.objectViewer"
    }

  # google_project_organization_policy.external_ip_policy[0] will be created
  + resource "google_project_organization_policy" "external_ip_policy" {
      + constraint  = "compute.vmExternalIpAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all = true
            }
        }
    }

  # google_project_organization_policy.shielded_vm_policy[0] will be created
  + resource "google_project_organization_policy" "shielded_vm_policy" {
      + constraint  = "compute.requireShieldedVm"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = false
        }
    }

  # google_project_organization_policy.trustedimage_project_policy[0] will be created
  + resource "google_project_organization_policy" "trustedimage_project_policy" {
      + constraint  = "compute.trustedImageProjects"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "is:projects/deeplearning-platform-release",
                ]
            }
        }
    }

  # google_project_service.enabled_services["bigquery.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "bigquery.googleapis.com"
    }

  # google_project_service.enabled_services["bigquerystorage.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "bigquerystorage.googleapis.com"
    }

  # google_project_service.enabled_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.enabled_services["notebooks.googleapis.com"] will be created
  + resource "google_project_service" "enabled_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "notebooks.googleapis.com"
    }

  # google_service_account.sa_p_notebook will be created
  + resource "google_service_account" "sa_p_notebook" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = "Notebooks in trusted environment"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.user_scripts_bucket will be created
  + resource "google_storage_bucket" "user_scripts_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
              + "HEAD",
              + "PUT",
              + "POST",
              + "DELETE",
            ]
          + origin          = [
              + "http://user-scripts",
            ]
          + response_header = [
              + "*",
            ]
        }
    }

  # google_storage_bucket_iam_binding.binding will be created
  + resource "google_storage_bucket_iam_binding" "binding" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_object.notebook_post_startup_script will be created
  + resource "google_storage_bucket_object" "notebook_post_startup_script" {
      + bucket         = (known after apply)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "notebooks/startup_script.sh"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./scripts/build/startup_script.sh"
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.notebooks["notebooks/BigQuery_tutorial.ipynb"] will be created
  + resource "google_storage_bucket_object" "notebooks" {
      + bucket         = (known after apply)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "notebooks/BigQuery_tutorial.ipynb"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./scripts/build/notebooks/BigQuery_tutorial.ipynb"
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.notebooks["notebooks/Exploring_gnomad_on_BigQuery.ipynb"] will be created
  + resource "google_storage_bucket_object" "notebooks" {
      + bucket         = (known after apply)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "notebooks/Exploring_gnomad_on_BigQuery.ipynb"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./scripts/build/notebooks/Exploring_gnomad_on_BigQuery.ipynb"
      + storage_class  = (known after apply)
    }

  # google_storage_bucket_object.notebooks["notebooks/Quantum_Simulation_qsimcirq.ipynb"] will be created
  + resource "google_storage_bucket_object" "notebooks" {
      + bucket         = (known after apply)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "notebooks/Quantum_Simulation_qsimcirq.ipynb"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./scripts/build/notebooks/Quantum_Simulation_qsimcirq.ipynb"
      + storage_class  = (known after apply)
    }

  # random_id.default[0] will be created
  + resource "random_id" "default" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # time_sleep.wait_120_seconds[0] will be created
  + resource "time_sleep" "wait_120_seconds" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # module.project_radlab_ds_analytics[0].module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project_radlab_ds_analytics[0].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "abc"
      + id                  = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.project_radlab_ds_analytics[0].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project_radlab_ds_analytics[0].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.project_radlab_ds_analytics[0].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.vpc_ai_notebook[0].module.firewall_rules.google_compute_firewall.rules["fw-ai-notebook-allow-internal"] will be created
  + resource "google_compute_firewall" "rules" {
      + creation_timestamp = (known after apply)
      + description        = "Firewall rule to allow traffic on all ports inside *vpc-analytics* VPC network."
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "fw-ai-notebook-allow-internal"
      + network            = "ai-notebook"
      + priority           = 65534
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/8",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc_ai_notebook[0].module.subnets.google_compute_subnetwork.subnetwork["us-central1/subnet-ai-notebook"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "Subnetwork inside *vpc-analytics* VPC network, created via Terraform"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.142.190.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-ai-notebook"
      + network                    = "ai-notebook"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = []
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc_ai_notebook[0].module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "VPC Network created via Terraform"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = 0
      + name                            = "ai-notebook"
      + project                         = (known after apply)
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_id               = (known after apply)
  + notebooks-usermanaged-names = "usermanaged-notebooks-1"
  + project_id                  = (known after apply)
  + user-scripts-bucket-uri     = (known after apply)

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
% 
```